Revit 2027 API
Application.GetFailureDefinitionRegistry Method
 Returns the instance of FailureDefinitionRegistry.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionRegistry GetFailureDefinitionRegistry()
Public Shared Function GetFailureDefinitionRegistry As FailureDefinitionRegistry
public:
static FailureDefinitionRegistry^ GetFailureDefinitionRegistry()
static member GetFailureDefinitionRegistry : unit -> FailureDefinitionRegistry
Return Value
FailureDefinitionRegistry
 The instance of FailureDefinitionRegistry.
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace